t21/Walnut_X/Packages/.cache/Keil.LPC4300_DFP.2.6.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>
  <package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
    <vendor>Keil</vendor>
    <url>http://www.keil.com/pack/</url>
    <name>LPC4300_DFP</name>
    <description>NXP LPC4300 Series Device Support, Drivers and Examples</description>

    <releases>
      <release version="2.6.0" date="2016-02-01">
        CMSIS device:
        - updated system_LPC43xx*.c file
        Updated GPDMA driver to transfer data larger than 4k.
        CMSIS driver:
        - added CAN: driver and configuration options in RTE_Device.h
        - updated all: corrected PowerControl function for conditional Power full state (driver must be initialized)
        - updated USART, I2S, SSP: interwork with new GPDMA driver
        - updated USB Device: removed unnecessary __packed specifier for GCC compliance
        - updated EMAC: corrected return value of the ReadFrame function
        Board examples for Keil MCB1800:
        - added CAN Data and CAN RTR MDK projects
      </release>
      <release version="2.5.0" date="2015-06-19">
        Updated CMSIS drivers:
        - I2C, MCI, EMAC, I2S, SPI, USART, USB Device, USB Host: Updated initialization, uninitialization and power procedures
        - I2S, SPI, USART, USB Device, USB Host: Corrected status bit-field race conditions
        - MCI:
        -- Interrupt processing optimized
        -- Data timeout handling corrected
        Updated example USB device VirtualCOM
      </release>
      <release version="2.4.0" date="2015-04-24">
        Device support:
        - updated device features
        Updated CMSIS Driver:
        - I2S: improved fs divider calculation
        - MCI: avoid DMA buffer alignment issues
        - USART:
        -- corrected disabling of receive DMA channel when aborting Receive or Transfer
        -- moved fract_div_lookup_table from header file to driver .c file
        Updated Example for USB Device Mass Storage
      </release>
      <release version="2.3.0" date="2015-03-20">
        Required PACKs: ARM.CMSIS.4.3.0.pack, Keil.MDK-Middleware.6.3.0.pack, Keil.ARM_Compiler.1.0.0.pack
        Updated drivers:
         - added support for Cortex-M0APP and Cortex-M0SUB
         - RTE_Device.h (driver configuration):
         -- corrected RTE_USB1_IND0_PIN_EN into RTE_USB1_IND1_PIN_EN
         -- removed RTE_USB_USB0_DEV_EP and RTE_USB_USB1_DEV_EP
         - EMAC: corrected return value of PHY_Read and PHY_Write functions
         - MCI: enabled High speed capability and added block size handling
         - SPI/SSP: corrected pin handling, ssp->info->mode handling
         - USART: improved baudrate calculation        
         - USB Device:
         -- corrected isochronous endpoint configuration
         -- corrected transfer procedure
         -- corrected CLK_M4_USB1_CFG into CLK_M4_USB0_CFG in USBD_PowerControl function
        Updated examples:
         - Compiler I/O software component is now used for I/O retargeting
        Added:
         - Startup file for Cortex-M0SUB Core
         - System files for Cortex-M0APP and M0SUB Cores
         - I2S driver
         - USB Device Audio example
         - Audio Board interface
         - NGC LPC4330-Xplorer Board support with examples
         - User Command for post build to flash devices in PDSC
        Changed compile define to CORE_CM4, CORE_CM0 and CORE_CM0SUB
      </release>
      <release version="2.2.0" date="2014-12-11">
        Updated for use with MDK-Middleware Version 6.2:
        - File_Demo and USB Host MassStorage examples due to new fdelete() API in File System 6.2
        - emWin GUIDemo example (corrected JOYSTICK orientation)
        Corrected:
        - peripheral reset
        - system_LPC43xx.c and updated examples accordingly
        - USBD0 driver corrected PORTSC1_D_PFSC into USB_PORTSC1_D_PFSC
        - SCU driver SCU_SFSCLKx(clk_pin) and SCU_ENAIOx(n) macros
        - USART driver modem lines handling
        - SPI0/1 driver avoid stack corruption
        - GPDMA driver initialization and uninitialization is done from drivers
        - ETH driver GetMacAddress function implemented
        Updated SVD file.
      </release>
      <release version="2.1.0" date="2014-07-15">
        Corrected Touch calibration in GUIDemo example (for use with Keil.MDK-Middleware.6.1.0)
        Corrected conditions for SPI drivers and ARM Compiler toolchain dependency
        Updated USB Device drivers
        Updated Flash Programming Algorithm
      </release>
      <release version="2.0.0" date="2014-06-12">
        CMSIS Driver V2 compliant drivers (requires ARM.CMSIS.4.1.0)
        - I2C, MCI, SSP, SPI, USART, USB Host and Device, Ethernet MAC
        Examples for MCB4300 Evaluation Board (requires Keil.MDK-Middleware.6.0.0)
        - USB, Network, Graphics and Filesystem
        Board Support Interface drivers
        - ADC, Buttons, Joystick, Graphic LCD, Touchscreen, EEPROM, Thermometer
      </release>
      <release version="1.0.1">
        New device: LPC4370
        Added Board description for Keil MCB4300
      </release>
      <release version="1.0.0">
        Initial version of LPC4300 Device Family Pack.
      </release>
    </releases>

    <keywords>
      <!-- keywords for indexing -->
      <keyword>NXP</keyword>
      <keyword>Device Support</keyword>
      <keyword>Device Family Package NXP</keyword>
      <keyword>LPC4300</keyword>
      <keyword>LPC43xx</keyword>
    </keywords>

  <devices>

    <family Dfamily="LPC4300 Series" Dvendor="NXP:11">
      <processor Pname="Cortex-M4" Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="204000000"/>
      <processor Pname="Cortex-M0" Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="204000000"/>
      <description>
NXP's LPC4300 Digital Signal Control (DSC) processors, offers high-performance signal processing capabilities. These DSC processors offer a high level of system integration, reducing system design cost and complexity, while simplifying the design cycle using a single tool chain.
Typical applications include Motor control, Embedded audio applications, Power management, Industrial automation, White goods, e-metering, RFID readers

  - Three PLLs
  - Quad SPI Flash interface (SPIFI)
  - State Configurable Timer (SCT)
  - LCD Controller (1024x768) for STN and TFT
  - Motor control PWM for three-phase motor
  - Unique ID for each device
      </description>
      <feature type="CAN"           n="2"/>
      <feature type="UART"          n="4"/>
      <feature type="I2C"           n="2"/>
      <feature type="Timer"         n="4"       m="32"/>
      <compile header="Device/Include/LPC43xx.h"/>
      <compile Pname="Cortex-M4" define="CORE_M4"/>
      <compile Pname="Cortex-M0" define="CORE_M0"/>
      <debug      svd="SVD/LPC43xx.svd"/>
      <book  Pname="Cortex-M4"     name="Documents/dui0553a_cortex_m4_dgug.pdf"      title="Cortex-M4 Generic User Guide"/>
      <book  Pname="Cortex-M0"     name="Documents/dui0497a_cortex_m0_r0p0_generic_ug.pdf" title="Cortex-M0 Generic User Guide"/>
      <book       name="Documents/UM10503.pdf"                          title="LPC4300 Series Reference Manual"/>
      <book       name="Documents/ES_LPC43X0.pdf"                       title="LPC4300 Series Erratasheet"/>
      <book       name="Documents/TN00006.pdf"                          title="LPC4300 Series Memory Map"/>


